###############################################################
#  Generated by:      Cadence Encounter 13.13-s017_1
#  OS:                Linux x86_64(Host ID hamster)
#  Generated on:      Mon May 11 10:32:47 2026
#  Design:            RISCV_superscalar
#  Command:           saveDesign ./RISCV_superscalar_postroute.enc
###############################################################
current_design RISCV_superscalar
create_clock [get_ports {clock}]  -name my_clock -period 33.333300 -waveform {0.000000 16.666700}
set_propagated_clock  [get_ports {clock}]
set_wire_load_mode enclosed
set_input_delay -add_delay 3.33333 -clock [get_clocks {my_clock}] [get_ports {reset}]
set_clock_uncertainty 0 [get_clocks {my_clock}]
