###############################################################
#  Generated by:      Cadence Encounter 13.13-s017_1
#  OS:                Linux x86_64(Host ID mandrill)
#  Generated on:      Sat May  9 18:58:23 2026
#  Design:            RISCV_superscalar
#  Command:           saveDesign results/RISCV_superscalar_final.enc
###############################################################
current_design RISCV_superscalar
create_clock [get_ports {clock}]  -name my_clock -period 28.571400 -waveform {0.000000 14.285700}
set_propagated_clock  [get_ports {clock}]
set_wire_load_mode enclosed
set_input_delay -add_delay 2.85714 -clock [get_clocks {my_clock}] [get_ports {reset}]
set_clock_uncertainty 0 [get_clocks {my_clock}]
