###################################################################

# Created by write_sdc on Mon May 11 09:32:41 2026

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_wire_load_mode segmented
create_clock [get_ports clock]  -name my_clock  -period 33.3333  -waveform {0 16.6667}
set_clock_uncertainty 0  [get_clocks my_clock]
set_input_delay -clock my_clock  3.33333  [get_ports reset]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_63]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_62]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_61]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_60]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_59]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_58]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_57]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_56]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_55]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_54]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_53]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_52]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_51]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_50]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_49]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_48]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_47]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_46]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_45]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_44]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_43]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_42]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_41]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_40]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_39]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_38]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_37]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_36]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_35]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_34]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_33]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_32]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_31]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_30]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_29]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_28]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_27]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_26]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_25]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_24]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_23]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_22]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_21]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_20]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_19]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_18]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_17]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_16]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_15]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_14]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_13]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_12]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_11]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_10]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_9]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_8]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_7]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_6]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_5]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_4]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_3]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_2]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_1]
set_input_delay -clock my_clock  3.33333  [get_ports instruction_0]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][31}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][30}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][29}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][28}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][27}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][26}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][25}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][24}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][23}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][22}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][21}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][20}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][19}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][18}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][17}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][16}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][15}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][14}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][13}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][12}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][11}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][10}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][9}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][8}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][7}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][6}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][5}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][4}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][3}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][2}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][1}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_0][0}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][31}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][30}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][29}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][28}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][27}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][26}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][25}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][24}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][23}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][22}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][21}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][20}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][19}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][18}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][17}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][16}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][15}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][14}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][13}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][12}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][11}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][10}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][9}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][8}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][7}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][6}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][5}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][4}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][3}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][2}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][1}]
set_input_delay -clock my_clock  3.33333  [get_ports {data_i_1][0}]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_31]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_30]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_29]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_28]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_27]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_26]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_25]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_24]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_23]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_22]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_21]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_20]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_19]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_18]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_17]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_16]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_15]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_14]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_13]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_12]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_11]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_10]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_9]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_8]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_7]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_6]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_5]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_4]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_3]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_2]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_1]
set_output_delay -clock my_clock  3.33333  [get_ports instructionAddress_0]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][31}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][30}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][29}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][28}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][27}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][26}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][25}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][24}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][23}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][22}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][21}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][20}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][19}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][18}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][17}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][16}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][15}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][14}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][13}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][12}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][11}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][10}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][9}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][8}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][7}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][6}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][5}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][4}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][3}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][2}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][1}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_0][0}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][31}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][30}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][29}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][28}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][27}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][26}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][25}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][24}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][23}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][22}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][21}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][20}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][19}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][18}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][17}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][16}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][15}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][14}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][13}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][12}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][11}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][10}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][9}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][8}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][7}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][6}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][5}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][4}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][3}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][2}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][1}]
set_output_delay -clock my_clock  3.33333  [get_ports {dataAddress_1][0}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][31}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][30}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][29}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][28}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][27}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][26}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][25}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][24}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][23}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][22}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][21}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][20}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][19}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][18}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][17}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][16}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][15}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][14}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][13}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][12}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][11}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][10}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][9}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][8}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][7}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][6}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][5}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][4}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][3}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][2}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][1}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_0][0}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][31}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][30}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][29}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][28}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][27}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][26}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][25}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][24}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][23}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][22}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][21}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][20}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][19}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][18}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][17}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][16}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][15}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][14}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][13}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][12}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][11}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][10}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][9}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][8}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][7}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][6}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][5}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][4}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][3}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][2}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][1}]
set_output_delay -clock my_clock  3.33333  [get_ports {data_o_1][0}]
set_output_delay -clock my_clock  3.33333  [get_ports {MemWrite_0][3}]
set_output_delay -clock my_clock  3.33333  [get_ports {MemWrite_0][2}]
set_output_delay -clock my_clock  3.33333  [get_ports {MemWrite_0][1}]
set_output_delay -clock my_clock  3.33333  [get_ports {MemWrite_0][0}]
set_output_delay -clock my_clock  3.33333  [get_ports {MemWrite_1][3}]
set_output_delay -clock my_clock  3.33333  [get_ports {MemWrite_1][2}]
set_output_delay -clock my_clock  3.33333  [get_ports {MemWrite_1][1}]
set_output_delay -clock my_clock  3.33333  [get_ports {MemWrite_1][0}]
